[
  {
    "Text": "the real revolution is the aspect ratio of this video",
    "Author": "@matteframe",
    "Likes": "15000"
  },
  {
    "Text": "Paleolithic emotions, medeival institutions and god-like technologies...what could go wrong?",
    "Author": "@jacquelinecane4663",
    "Likes": "7000"
  },
  {
    "Text": "RIGHT NOW there are people who lived without the internet and people who were born with it. That''s never going to happen again. We knew the world before the internet. It changed things forever. But these two people will never live together again after we pass away. Those who knew the world before.",
    "Author": "@michaelpipkin9942",
    "Likes": "5400"
  },
  {
    "Text": "never seen someone so openly excited about the incoming dystopia.",
    "Author": "@prestonflood5246",
    "Likes": "5200"
  },
  {
    "Text": "Wow, this one really shakes you up. Leyden’s point that 2025 isn’t just another year but a junction where tech, society and our possibilities all collide hit me. It’s like you realise you’re not waiting for change — you’re in the change. Reading They Taught You to Be Nice Not Strong by Orrin Conway helped me see that when everything shifts around you, you’ve got to build the inner stuff now so you don’t get swept away.",
    "Author": "@jasWiss9",
    "Likes": "3100"
  },
  {
    "Text": "We''re not moving toward a digital democracy, we''re moving toward authoritarianism.",
    "Author": "@jpleonard2000",
    "Likes": "2400"
  },
  {
    "Text": "When I see a video this well produced, it gives me pause to consider who is funding it''s message.",
    "Author": "",
    "Likes": "1700"
  },
  {
    "Text": "In reality, the top 0.1% and their corporations will ultimately be the new global leaders.  Sounds dystopian to me.",
    "Author": "@steevf",
    "Likes": "1400"
  },
  {
    "Text": "I''m 67, and as a child, my dad took us down to his workplace, to see the new \"computer\", which took up a very large room.  Now, we all walk around with one in our hands.  Unimaginable.  Sometimes, I wish we could go back to simpler times, as I guess most old people do.",
    "Author": "@annmc-t7p",
    "Likes": "1000"
  },
  {
    "Text": "The problem is we keep evolving technology while standing still as human beings. It’s been a while since humans have taken a step towards evolving as a race instead of trying to invent more distractions….",
    "Author": "@knightofAK",
    "Likes": "1000"
  },
  {
    "Text": "Why did we stop taxing the rich at 90%?",
    "Author": "@unimpressedsquidward3059",
    "Likes": "987"
  },
  {
    "Text": "\"Come back next year to see why 2026 will be the actual single most pivotal year in our lifetime.\"",
    "Author": "@dustinbloodgood",
    "Likes": "863"
  },
  {
    "Text": "Important to remember that this is the future as seen by a futurist. These are the same guys who predicted Mars colonies and flying cars by 2000. We love to predict the future, and we are usually wrong.",
    "Author": "@MrGringissimo",
    "Likes": "799"
  },
  {
    "Text": "He reminds me of people so excited about the promise of the internet in the mid 90''s. All the wonderful boon to humanity it would be having everyone connected. The best ideas would rise to the top and be accepted and understood by everyone because information was free and everyone could have access to all the information without barriers. Competition would ensure misinformation could be easily identified and dismissed. The economic benefit would be staggering. Here we are, 30 years on. Very much a mixed bag.",
    "Author": "@SteveBonario",
    "Likes": "606"
  },
  {
    "Text": "This video is a shining example of why the SEC requires the disclaimer \"past performance is not indicative of future results\".",
    "Author": "@SeanofAllTrades",
    "Likes": "598"
  },
  {
    "Text": "Okay. As if AI won’t be a tool that transfers all power and wealth to an elite minority. Sure. Keep dreaming.",
    "Author": "@bardactic3302",
    "Likes": "524"
  },
  {
    "Text": "we should really stop saying \"the top 1%\" when referring to people worth $100B+. Someone worth like $10m (a \"1%''er\") is not in the same universe as someone who is worth $1B. And someone who is worth $1B is not in the same universe as someone who is worth $100B.  When people talk about the top 1%, they''re actually talking about the top 0.0001% usually.",
    "Author": "@particle_wave7614",
    "Likes": "477"
  },
  {
    "Text": "This video was a LOT more optimistic than what I’m imagining …",
    "Author": "@AnonymousSpirit",
    "Likes": "404"
  },
  {
    "Text": "Its incredible that he says all of this in a positive light with a smile on his face.  That was terrifying",
    "Author": "@DillonGlenn-g7z",
    "Likes": "357"
  },
  {
    "Text": "Making predictions with confidence is a surefire way to sound untrustworthy.",
    "Author": "@jacquesrosondil",
    "Likes": "344"
  },
  {
    "Text": "4:10 \"we had to resolve this political tension in america, and in the world\". My man a world war of unimaginable proportions is not something you can just refer to as simply resolving political tension",
    "Author": "@ProfessorHenrique2024",
    "Likes": "340"
  },
  {
    "Text": "He’s talking about the Fourth Turning, as detailed by Neil Howe and William Strauss. The Fourth Turning is a time when old clashes with new and there are massive conflicts politically and socially. Frequently that means war and the last few times it was global conflict. Hopefully not this time.",
    "Author": "@Fabulist",
    "Likes": "294"
  },
  {
    "Text": "May be some truth in this but agree with alot of the comments, humanity/society hasn''t evolved sufficiently enough to deal with the next epoch. Corporations, extremism and partisan untrustworthy governments are causing the fractures in society which I don''t think the majority of  human beings can come back from.",
    "Author": "@Waisalik",
    "Likes": "272"
  },
  {
    "Text": "I''m SO GRATEFUL I was born in the 60''s- BEFORE the internet & cell phones. So I got to enjoy what life was like before this hot mess.",
    "Author": "@OneRulePlayNice",
    "Likes": "271"
  },
  {
    "Text": "I got my life back after ditching my smartphone. The rewiring of our brains has been drastic for humanity. The most successful experiment in social engineering and social control ever conducted.",
    "Author": "@MartianTom",
    "Likes": "245"
  },
  {
    "Text": "Missed opportunity to do ABCs of the new age: AI, Bioengineering, Clean energy.",
    "Author": "@thisguyispeculiar",
    "Likes": "239"
  },
  {
    "Text": "\"GUYS JUST TRUST ME BRO AI IS THE FUTURE BRO YOUR WATER BILL IS DOUBLING AND YOUR PARENTS HAVE NO HEALTHCARE BUT PLEASE BRO HERE’S A HALLUCINATED PICTURE OF A STEAMPUNK BRAZILLIAN FAVELLA IT''S SO COOL BRO\"",
    "Author": "@lynxia1464",
    "Likes": "214"
  },
  {
    "Text": "I think all the comments section is pretty nice, no one is believing blindly these \"technological utopia\". And also I think is important to clarify how, by sequencing of human genome, biologist understood how little they understand genomes. And the more information we have, the more we know there are many things we don''t understand and don''t know. CRISPR is, with reason, only used in laboratory.",
    "Author": "@matiasramirezn520",
    "Likes": "162"
  },
  {
    "Text": "The most important thing that should be on everyone mind currently should be to invest in different sources of income that doesn''t depend on the government. pretty much how i made my first million. Especially with the current economic crisis around the word. This is still a good time to invest in various stocks gold, silver and digital currencies.I am grateful to be informed by my ever able advisor",
    "Author": "@stanleyfujiwara1394",
    "Likes": "156"
  },
  {
    "Text": "I''m 52, and I always say, we were the last generation that was able to really bridge the gap between the analog era and the digital era. My parents, like many, were left behind. I feel privileged to have been able to experiance both casette tapes and the iPod in one lifetime. To the future!",
    "Author": "@thedarksurfer.",
    "Likes": "137"
  },
  {
    "Text": "There is nothing scarier than the idea of global governance.",
    "Author": "@McInerneyEoin",
    "Likes": "112"
  },
  {
    "Text": "I wish I could have that 15 min back.",
    "Author": "@logangeorgej",
    "Likes": "112"
  },
  {
    "Text": "8:00 \"...Americans, who had this wide open continent to spread into.\" I won''t make any assumptions about this person''s knowledge or intent, but this is a dangerous way to frame that period of time. The continent wasn''t empty, waiting for ''Americans'' to take it. It was and already had been home to millions of people which we displaced, usually violently and cruely. This is not meant to be an attack on the speaker or channel, just highlighting a common misconception which is dangerous because it erases the horrendous acts that occurred during that period.",
    "Author": "@sapling_parajito",
    "Likes": "103"
  },
  {
    "Text": "Yes, it''s a turning point. I do not share the optimism about the changes expected in the future laid out at the end. The extreme leverage the powerfull have today will only become stronger. The world where multilateralism has some relevance is waning.",
    "Author": "@shininio",
    "Likes": "101"
  },
  {
    "Text": "Looking forward to departing before Global Governance.",
    "Author": "@FilmWrap2000",
    "Likes": "97"
  },
  {
    "Text": "People act like all this AI and “clean tech” means we’ve reinvented the wheel, but really we’ve just changed the power source. We’re still deeply dependent on resource extraction — just different materials like lithium, nickel, and rare earths instead of oil and gas. And as everything goes electric, we’re basically plugging humanity into an outlet 24/7. The tech might be cleaner at the point of use, but the system behind it still has a massive environmental footprint. Real progress means reducing total dependency, not just switching what we’re dependent on.",
    "Author": "@ShroomJesus",
    "Likes": "79"
  },
  {
    "Text": "00:19 i hate when people especially in videos like this and movies, focus on only america like america is the only country to exist in the world, a lot of americans do this and i feel like its how you guys are raised by school and the system BUT its like these are turning points for everyone in the world lol, america has only existed for 300 years and is literally made from the english spanish and africa (obvs not including the smaller groups like italians, asians, russians, irish, etc) that all moved there since its literally built from most other countries but yh, pet peeve over",
    "Author": "@slowlywins",
    "Likes": "69"
  },
  {
    "Text": "I switched my display to ultrawide and now I can finally see all the extra disappointment in 15 minutes.",
    "Author": "@CHKDG8",
    "Likes": "65"
  },
  {
    "Text": "I need to ask my local cinema If they have a big enough screen to watch this. One sec",
    "Author": "@goofymcadams",
    "Likes": "65"
  },
  {
    "Text": "What is fascinating about this video is that by looking at the past we can ''see'' the future, but here is the thing - the world is moving exponentially, faster than ever before and the truth is we can''t keep up with it.",
    "Author": "@raykleiner3151",
    "Likes": "61"
  },
  {
    "Text": "He conveniently glossed over how corporations in America used the Republican Party to put an end to the post-war boom era by deregulation, slashing programs that helped the needy, giving tax breaks to the wealthy and giving corporations/billionaires much more political power.   We are still living in the oligarchy hellscape they created as a result.",
    "Author": "@deltaroo420",
    "Likes": "60"
  },
  {
    "Text": "There are several parallel systems already in place both internationally and domestically to replace all the current American systems. People with power in the current systems are just trying to set it up so THEY land on their feet in the new system. That is what is really going on.",
    "Author": "@greorbowlfinder7078",
    "Likes": "59"
  },
  {
    "Text": "The video ending on the subject of \"Global Governance\" followed by the freethink* logo is too perfect.",
    "Author": "@D3adP00I",
    "Likes": "51"
  },
  {
    "Text": "The transition will be from employed to unemployed. It will be brutal and bloody!",
    "Author": "@binmanblog",
    "Likes": "49"
  },
  {
    "Text": "Every year ever has been the most pivotal year.",
    "Author": "@a4ewald",
    "Likes": "46"
  },
  {
    "Text": "The absolute manifestation of idealism as a person. I didn’t see a single point bringing up the implications of such sudden change",
    "Author": "@XiAnais-bt9ke",
    "Likes": "42"
  },
  {
    "Text": "To believe the genome holds the key to life is to mistake a library for the librarian and the readers. Understanding DNA alone won’t cure disease until we grasp how its words are read, edited and performed in the cellular environment and more broadly by the body.",
    "Author": "@fburton8",
    "Likes": "38"
  },
  {
    "Text": "I think the future depends upon not only new technology but how we are going to use this tech breakthrough for social and personal growth of humanity. How we can improve educational, healthcare, policy and economy system in the new technological environment?",
    "Author": "@mulen-x8u",
    "Likes": "33"
  },
  {
    "Text": "I do like this framing “out with the old, in with the new” as curves instead of as a dichotomy.",
    "Author": "@HollyOly",
    "Likes": "31"
  },
  {
    "Text": "This analysis doesn''t take into account that it was a parasitic system that we can no longer maintain and that there were centers of power spread across the world. Both of these factors lead to a (mentioned) world government that would have given even Orwell severe heartburn—to say the least. Now we have a massive oversupply of human labor that is useless for the 1%. WE ARE F*CKED!",
    "Author": "@OlliR1602",
    "Likes": "31"
  },
  {
    "Text": "10:16 it makes me sad that people bever think about the human cost in the 3rd world countries that have to mine the minerals that create these technologies and “innovations” and even the communities in our own that are subject to water pollution due to the energy demands of AI. We truly will never learn",
    "Author": "@kibayi",
    "Likes": "30"
  },
  {
    "Text": "My widescreen monitor really appreciated displaying this video.",
    "Author": "@0xSetaro",
    "Likes": "26"
  },
  {
    "Text": "The thing that scares me is not AI, etc rather the ‘Global Governance’ bit at 14:16",
    "Author": "@dermotcorcoran3181",
    "Likes": "20"
  },
  {
    "Text": "As someone who has watched youtube on my 21:9 monitor for a few years, i am in awe that this video is wider than my widescreen.   I never thought id see the day",
    "Author": "@urjika9001",
    "Likes": "18"
  },
  {
    "Text": "One thing you may have over looked that will provide the arrow of fundamental change in \"our\" world is the coming environmental change. To prepare the groundwork for that \"different way of thinking\" is for everyone, especially the young to reconnect with the natural world so \"our world\" reflect an ecology of mind representing a major paradigm shift. We can not forget our roots--we are a biological and ecological species.",
    "Author": "@rssemmens1",
    "Likes": "11"
  },
  {
    "Text": "Global governance assumes we would all want to be together, but that''s never happened in history.",
    "Author": "@lraoux",
    "Likes": "7"
  },
  {
    "Text": "What an optimist. Totally negating the negative aspect of any of those 3 techs. It''s not clean. It''s not a cow. It''s not intelligent.",
    "Author": "@tubeorip",
    "Likes": "5"
  },
  {
    "Text": "My grandpa was born in 1902, when airplanes were just INVENTED, and my dad was born he day the first man entered SPACE. I am alive for AI! Wow.",
    "Author": "@sherriffandrew",
    "Likes": "5"
  },
  {
    "Text": "I think there’s a strong point to make, that this current boom we are in is a “post-covid” boom. We might not see it now, but looking back on historically, it lines up perfectly. Society fell into a tech rhythm, fueled by isolationism driven by covid.  Covid was the only worldwide event to genuinely change all of humanities lives since World War II.",
    "Author": "@grantsherman2001",
    "Likes": "3"
  },
  {
    "Text": "I can''t say for anything else, but the age of American centralism this guy was clearly born into is slowly coming to an end",
    "Author": "@BboyFever",
    "Likes": "1"
  },
  {
    "Text": "The clickbait: \"THE MOST PIVOTAL THING YOU WILL EVER SEE, THIS IS THE MOST IMPORTANT THING TO EVER HAPPEN IN THE UNIVERSE\"  The content: Literally just shlt you already know",
    "Author": "@edgecase96",
    "Likes": "1"
  },
  {
    "Text": "The reason you are listening to this is to concentrate.. That shows your dedication and desire to improve... Congratulations everyone.. Stay motivated.. If you make a start..you are halfway done.. Dont give up..",
    "Author": "@WealthRewind-usa",
    "Likes": ""
  },
  {
    "Text": "Things (and life) will get worse for most people before they get better. The question is how fast and how bad.",
    "Author": "@fburton8",
    "Likes": "138"
  },
  {
    "Text": "He forgets the control that companies have over our government.  Politics and they people that play those games are intertwined.  Let''s not forget, it is companies that own AI.",
    "Author": "@BoerBoel-ox1tv",
    "Likes": "60"
  },
  {
    "Text": "Back in 1970 I had a paper route, two actually. I had just finished delivering my papers one day, and went into my hang-out pizza place to play a few games of pinball before heading home for dinner. I walked in and saw a couple of kids in front of a black and white TV screen. I walked over and saw that they were playing a computer game. It was called Pong. I still clearly remember the thought in my head at that time. \"The world has changed. My world has changed.\" I built my first gaming computer, before the term gaming computers began to be used, back when Windows 95 was a new operating system. From where I am sitting, as I play around with Gemini 2.5, the world is about to change, in ways we cannot even conceive. Buckle up!",
    "Author": "@Graybeard_",
    "Likes": "20"
  },
  {
    "Text": "He said solar energy doesn’t require mining materials, it’s purely a technology, except solar panels do require mining of raw materials, same with the lithium batteries the guy mentioned. This guy sounds like an evangelist for transhumanism and globalism, a more positive version of Yuval Harare",
    "Author": "@camfella647",
    "Likes": "17"
  },
  {
    "Text": "Its fascinating to me how these innovations really come in waves, youll have decades of medical innovations that look promising but go nowhere, and suddently someone invets something totally unrelated, and its like humanities collective innovation drive activates and all the promising things that went nowhere get fully developed.  All the 200 alternatives to plastic, or better batteries, or cures to cancer that we keep finding but are rarely implemented, and now suddently its like we decide to do it all at once.",
    "Author": "@aguspuig6615",
    "Likes": "2"
  },
  {
    "Text": "2025 and 2026 is Pivotal for only 3 reasons.... Technology, Power and Authoritarianism",
    "Author": "@jimmyispromo",
    "Likes": "2"
  },
  {
    "Text": "Congratulations, you just described what has already been laid out in the 4th turning",
    "Author": "@-MakeItGood-",
    "Likes": "1"
  },
  {
    "Text": "The beauty and the terror of it is that not a single person has any idea what our future will look like. The amount of complexity this technological progress creates is just immeasurable, our current societal frameworks have no chance in withstanding this speed. It''s like strapping a rocket engine to a car frame and hoping it holds together.",
    "Author": "@purestfreedom",
    "Likes": ""
  },
  {
    "Text": "Corpo blaber. Remember how cheap uber was at launch? Try it now - that''s a boom strategy to push amenities to our throats BEFORE they gonna hit for the money.",
    "Author": "@SirVakari",
    "Likes": "29"
  },
  {
    "Text": "Just jump to 9:00",
    "Author": "@powerful_people-p7o",
    "Likes": "29"
  },
  {
    "Text": "\"This changes everything\" - most incorrectly used phrase of the last 10 years.",
    "Author": "@SyddG",
    "Likes": "26"
  },
  {
    "Text": "Dude I dunno, the way I see things is this: we''re getting absolutely screwed. No one wants AI to take all these jobs. People enjoy writing, people enjoy creating things.",
    "Author": "@misterbrickest",
    "Likes": "20"
  },
  {
    "Text": "“In the old south we basically had slavery.”",
    "Author": "@o_0malik",
    "Likes": "13"
  },
  {
    "Text": "4:33 Tax the rich at 90% - Sorry, What?",
    "Author": "@patrickoconnor5494",
    "Likes": "10"
  },
  {
    "Text": "Unsurprisingly, every year someone says the same thing. People always imagine that right now is the most revolutionary change happening.",
    "Author": "@mmikael281",
    "Likes": "6"
  },
  {
    "Text": "6:23 the homestead act that you describe as growth was genocidal ethnic cleansing (as most settler colonialism is). The changes look good to the victors. And the next victors might be AI. So best explain that the tipping point can fall to the left or the right. For example Roosevelt built that infrastructure by taxing the robber barons of the \"wonderful\" gilded age by 90%. You think it couldn''t have gone the other way?",
    "Author": "@kimcosmos",
    "Likes": "1"
  },
  {
    "Text": "WoW, I have lived to see a YT video fully supporting widescreen display and 1440p without silly black bars. Liked and Subscribed for that alone",
    "Author": "@hakunamatata324",
    "Likes": ""
  },
  {
    "Text": "Basically had slavery???? No it was slavery.",
    "Author": "@khaliqc1151",
    "Likes": "79"
  },
  {
    "Text": "9:54 Oh yes you have to dig it up.  Solar cells are made of silver, and that doesn''t come from thin air.  Same for lithium etc.",
    "Author": "@dansw0rkshop",
    "Likes": "64"
  },
  {
    "Text": "Humans have not become happier as technologies advanced, I don''t get his enthusiasm",
    "Author": "@watmosphere",
    "Likes": "35"
  },
  {
    "Text": "Great video. I have been having these discussions for over twenty years. I got my first computer in 1985. Watched war games and told my mum - one day all computers will be linked and I can have friends all over the world. I became a web designer in 1994 and was a web developer for over twenty years. I have experienced and contributed to the bubbles. This feels different. The technology has met the globalists agenda. This is it people - buckle up. I am a 53 year old creative and since the inception of OpenAi and generative AI, and painfully watched it develop into a creativity devouring behemoth. But as the fears of 1994 were it would be the end of printing, the current fears that it will end human creativity, is unfounded. It has a place as a tool to release the ideas faster. It’s a wonderful testing tool for all that you wish. For the older generation, we either embrace it, and find a place for it in our lives and stop reacting in fear or it devours us too. I wish every fellow human luck in their new world. This narrative trope is new, but the powers intentions and technology are different. Peace and love my fleshy biological friends.",
    "Author": "@MoreMooseMeat",
    "Likes": ""
  },
  {
    "Text": "Don''t count on global governance. It proved to be corrupt and self-serving during COVID and wars and people noticed.",
    "Author": "@puestadelsol2020",
    "Likes": "52"
  },
  {
    "Text": "How to show that you know nothing about LLMs, genome sequencing and \"clean\" energy without explicitly saying it.",
    "Author": "@thibaultabry5502",
    "Likes": "45"
  },
  {
    "Text": "I want the 15 minutes of my life back.",
    "Author": "@memyselfandI90001",
    "Likes": "43"
  },
  {
    "Text": "All that ''abundant clean energy'', thaaaat, the corporations will still charge exorbitant prices for. Gotta keep the proles down.",
    "Author": "@bretebey",
    "Likes": "26"
  },
  {
    "Text": "Pave the way to the future with one kindness at a time.",
    "Author": "@dercas79",
    "Likes": "5"
  },
  {
    "Text": "Politicians and prognosticators have been saying this exact thing millennia again and again from a relative point of speaking it’s always going to be this moment, isn’t it?",
    "Author": "@DurokSubaka",
    "Likes": "4"
  },
  {
    "Text": "As a general gen z guy I will push the future of tech and do my best to both push us (humanity) forward and learn from the older generations mistakes so I can make tomorrow better than you can imagine",
    "Author": "@nicholi6750",
    "Likes": ""
  },
  {
    "Text": "Too optimistic chill bro Reality will be high tech low life dystopian cyberpunk where You WILL own nothing and You WILL be happy Its over",
    "Author": "@mentalhaxx",
    "Likes": "46"
  },
  {
    "Text": "I can predict the future. We will have war, lots of people die and a lot of wealth is redistributed. Rebuilding produces new technologies, ideas and systems. Rinse and repeat at around ~80-100  year cycle.v",
    "Author": "@ex1tium",
    "Likes": "45"
  },
  {
    "Text": "6:19 - Not exactly \"anybody.\"",
    "Author": "@christophermanley3602",
    "Likes": "12"
  },
  {
    "Text": "I wonder what freedom looks like in a world that''s so dependent on technology we don''t own.",
    "Author": "@matthewdalton",
    "Likes": "1"
  },
  {
    "Text": "The feeling, the quality and the soundtrack used in this video is a spectacle.",
    "Author": "@HullMiDik",
    "Likes": ""
  },
  {
    "Text": "This dude''s predictions are whack. No mention of Oligarchs mining personal data and forcing everyone onto \"everything apps\" where if you don''t have it you''re basically not able to participate in society. Just whitewashed the whole thing.",
    "Author": "@squintsyadams8463",
    "Likes": "183"
  },
  {
    "Text": "10:30 you do have to dig up the materials for solar panels. ️️",
    "Author": "@I_OptimusPrime",
    "Likes": "85"
  },
  {
    "Text": "You missed Bitcoin. Separating money from the state has huge implications.",
    "Author": "@peeknic",
    "Likes": "8"
  },
  {
    "Text": "\"From the moment I understood the weakness of my flesh, it disgusted me.\"",
    "Author": "@Venim85",
    "Likes": "1"
  },
  {
    "Text": "This is pretty neat. I have been nerd-splaining to my friends about how the AI bubble we''re in is just like the industrial revolution and our life in 100 years will be completely unrecognizable. Its like when factories first opened and we needed regulations so people weren''t dying on production lines...",
    "Author": "@spagooterman",
    "Likes": ""
  },
  {
    "Text": "I’m unexpectedly optimistic now about the potential economic future of the US just off this video  The more I think and put trends together, as an Urban Planner, I foresee how close the United States is close to an economic collapse. For instance, I just remembered we’ve been in a government shut down for 3 weeks now and most of my peers don’t even realize it. We’re in unprecedented times that are not normal and it is clear the rules of our current social & economic contract are about to change, hopefully for the good, but could be really ugly if the United States doesn’t act as a unified force. I pray the Federal Government and everybody in our country can stop pointing their fingers at the other party and blaming it all on people with opposite beliefs and I pray my generation can help rebuild this country and ride this next innovation wave before our country collapses into chaos",
    "Author": "@daltonkaiser4224",
    "Likes": "12"
  },
  {
    "Text": "i’m opposite of excited",
    "Author": "@benkalore",
    "Likes": "7"
  },
  {
    "Text": "9:11 \"that once cross that threshold you don''t go back\" uhhh sir, we''ve  had like two bronze ages, the decline of the Roman Empire, mongols existed, and who knows what other setbacks/lost knowledge humanity has had... kinda hard to remember the things you''ve forgotten",
    "Author": "@ronisamurp",
    "Likes": "5"
  },
  {
    "Text": "This is a phenomenally educational and illustrative. It shows how an individual’s recall of his own lived experience is warped by the overemphasis of successful predictions: Amazon will change commerce, Google will change advertising, Wikipedia will change libraries. And the unintentional concealment of the missed predictions of those same times. This is why, in my opinion, Peter is so clearly wrong about generative ai.",
    "Author": "@ewetyube",
    "Likes": ""
  },
  {
    "Text": "Yep. Looks like the biggest resistance is from Fossil Fuel industry. They are really fighting back with disinformation campaigns, political meddling. Really dirty money.",
    "Author": "@unxusr",
    "Likes": "21"
  },
  {
    "Text": "Saying we \"basically had slavery\" when the country literally had slavery is completely minimizing the impact of slavery.   Video is informative but you should really consider researching more on the topic of slavery and it''s impact on 13% of America.",
    "Author": "@walterkimble6373",
    "Likes": "10"
  },
  {
    "Text": "That''s also extraordinary is the aspect ratio of this video.",
    "Author": "@aborne",
    "Likes": "7"
  },
  {
    "Text": "I see a lot of people clinging passionately to the old systems in these comments! They''re acting as if it''ll be the end of the world, JUST LIKE people did 80 years ago, and 80 years before that. Amazing that you can explain phenomenon to people who will still just as blindly be affected by it.",
    "Author": "@jacobkain4721",
    "Likes": ""
  },
  {
    "Text": "Black people were killed and had their land stolen during the homestead act. He is just glazing history",
    "Author": "@TheIshvalanHero",
    "Likes": "82"
  },
  {
    "Text": "This guy is so optimistic that it''s sad. It won''t be a digital democracy. It will be digital tyranny. You won''t be free to think a single unapproved thought.",
    "Author": "@user-wb4ty2ye7s",
    "Likes": "7"
  },
  {
    "Text": "This must be the reason this year is so tough....I pray I come out better and much more prosperous than ever..Om",
    "Author": "@sourishsaha8067",
    "Likes": "5"
  },
  {
    "Text": "This video is so well made, the transition, the colour, the graphics, the fonts, the music everything is on spot",
    "Author": "@pritz996",
    "Likes": ""
  },
  {
    "Text": "10:55 come on where do you get the materials to get that ''clean energy'' you dig you process you manufacture.......",
    "Author": "@sisix-05",
    "Likes": "10"
  },
  {
    "Text": "Advancement in technology(such as social media,now the chatbox Ai), does not mean an advancement to human race!. Look back at what technology of the recent past has done to the human potential, its pitiable.",
    "Author": "@aware2action",
    "Likes": "6"
  },
  {
    "Text": "I feel like I''ve seen this before.",
    "Author": "@ggghvv9937",
    "Likes": "6"
  },
  {
    "Text": "10:21 the prices would come down if the Federal Reserve stopped inflating currency. Corporations would charge less if they didn''t have a mandate to maximize profits.",
    "Author": "@caseyczarnomski8054",
    "Likes": "6"
  },
  {
    "Text": "Do I need 2 monitors to watch this video?",
    "Author": "@AnishShrestha-u3o",
    "Likes": "4"
  },
  {
    "Text": "07:25 ah yess, Iluminati mentioned",
    "Author": "@ArthurKingw",
    "Likes": "4"
  },
  {
    "Text": "So we''re gunna have clean energy driven AI cleaning our asses after we shit out bio engineered food.   Sounds awesome.",
    "Author": "@DChappelle27",
    "Likes": "1"
  },
  {
    "Text": "I believe that, when those things are definitely a given, the one thing that should also be a given and it''s about to boom is EMOTIONAL INTELLIGENCE. People are starting to realize that all this progress can''t be handled properly if those who apply said progress in their daily lives are not responsible for their emotional state, and therefore their actions. That''s going to give everyone the tools to make conscious and responsible choices, instead of letting those in power make those decisions for them.",
    "Author": "@itcamered",
    "Likes": ""
  },
  {
    "Text": "I was amused, the production quality of this video really done well. But at 15:08 .. you lost me. Maybe before that but for sure.. that.",
    "Author": "@Carlsings",
    "Likes": "16"
  },
  {
    "Text": "At about 8:05 you say that Americans had “a wide open continent” to spread through, implying there was no one around. That’s not true of course and it perpetuates a false narrative.  There’s another story to be told about the winners and losers of these epoch shifts. AI and other tech innovations are going to create another set of winners and losers.",
    "Author": "@magiktunes",
    "Likes": "12"
  },
  {
    "Text": "America''s first Epoch 1787 to 1812 was America starting to take over from Britain.  America''s last Epoch 2025 to 2050 is China starting to take over from America. The US no longer has the capacity to implement the things he is talking about 2025 to 2050",
    "Author": "@vaticinus",
    "Likes": "10"
  },
  {
    "Text": "Hmmm….”basically” had slavery AND “anybody” who went out West received 150 acres free….not true…those are lies by omission.  I was skeptically, tracking until you said that.  A person with a poor or distorted understanding of the past cannot have a grasp of the present nor the future.",
    "Author": "@BlueMarvelMe",
    "Likes": "7"
  },
  {
    "Text": "This makes the assumption that our modern technologically integrated civilization will survive to see the next century. On our current trajectory that prospect doesn''t look very likely.",
    "Author": "@deepashtray5605",
    "Likes": "6"
  },
  {
    "Text": "Absolutely astonishing that he does not mention the Soviet Union or China, actual revolutionary projects whose historically-unprecedented industrial and technological advancement compelled the US and other Western countries to invest more in innovation. It is often breathtaking how blinkered an existence people in the US live.",
    "Author": "@pwargan",
    "Likes": "3"
  },
  {
    "Text": "Sure, clean energy without digging materials...explain me, are those panels made of air?",
    "Author": "@lioninzion",
    "Likes": "1"
  },
  {
    "Text": "One important thing this guy is missing: each of these eras only came after a huge, legendary war.   So don’t get too excited Mr. Guy, you should understand the price of history.",
    "Author": "@InternetIsntReel",
    "Likes": ""
  },
  {
    "Text": "Bullshit, generative ai has no big or life changing application in the real world, similarly to blockchain. ML has some potential, but it''s not chatgpt or whatever.",
    "Author": "@twist197",
    "Likes": "12"
  },
  {
    "Text": "I want whatever this guy is smoking!",
    "Author": "@somjrgebn",
    "Likes": "9"
  },
  {
    "Text": "The rich were never taxed at 90%.There were so many loopholes.Nobody paid 90% That is dumb .",
    "Author": "@Pctmidlife",
    "Likes": "4"
  },
  {
    "Text": "Absolutely crazy how we''re in a middle of a certain age, back then they don''t even know, now with ease of access, we know a bit about our overall progress. I''m afraid and excited to see what''s the future for human race.  Crazy world we live in...",
    "Author": "@bowz_Vann",
    "Likes": ""
  },
  {
    "Text": "Stop saying “America” when you talk about things there are happen in the WORLD. This is a horrible, ugly habit thats a lot of UNITED STATES citizens have. In fact, this and other EGOTRIPCENTRIC things that are deeply rooted in this culture is EXACTLY what make this ass holes presidents.",
    "Author": "@Shivaroz9",
    "Likes": "26"
  },
  {
    "Text": "Dangerous ideas from a perverse ideology. No thanks! Glad I listened to understand the extent of the enthusiasm for these ani-human ideas. They necessarily involve the suppression of individuality (unless it is expressed through AI, human innovation and creativity (unless it is manifested through AI),  the balance of the natural world and a new \"master, slave\" relationship IMO.",
    "Author": "@dellacrean3296",
    "Likes": "5"
  },
  {
    "Text": "10:10 energy cannot be created. This is a very expensive delusion. The 1950’s ended and this rapid expansion of technology produced a monster of media. Reality is not a technological phenomenon",
    "Author": "@sparkybob1023",
    "Likes": "4"
  },
  {
    "Text": "This is fascinating. And yet I keep thinking of my high school teacher who said - lo those many years ago - our history has focused on technological innovation and neglected the development of human consciousness. What is the human challenge we face as these new technologies become a reality? How do we need to \"grow ourselves up\" to be responsible stewards during this next evolution?",
    "Author": "@marthafreymannmiser1363",
    "Likes": ""
  },
  {
    "Text": "He is either refusing to accept or utterly failed to see that these supposed 80 year cycles were following a great and costly conflict. So of course there is a boom, lots of babies, lots of jobs, some assholes got deleted, some competition got deleted, including global. Germans were very dominant on the world stage start of both wars in terms of economic presence that reflected on the USA. Also science and technology, necessity is the mother of invention, and war is a renowned necessity driver. There is also the great theft that occurs between warring countries after a conflict. Being the victor, the USA got alot of spoils of many kinds, land, titles, money, influence, global dominance, these things are to be taken into account for the success of a nation.   The liberal, globalist mindset fails to comprehend history outside their own bubble. It''s clear, globalism has failed. You can try to subjugate us as a tyrant but you will need to do so before we rally against you. And what I''m seeing IRL and the news, local and around the world is exactly that. You think of us as wanting tribes, we want community. With distinct cultures, values and appetites. I refuse to become a minority in my home land from people''s flown in enmass from elsewhere without my consent. My land, my history, is my own, it''s not my job to home the dispat populations of the world overcrowded where they come from, that''s their issue to solve not mine. If they want my land they will have to fight me for it if they want to invade",
    "Author": "@Kelmorcellus",
    "Likes": "4"
  },
  {
    "Text": "Reminds me how about 60 years ago people were absolutely sure that in 2-3 decades they will be flying to other planets on vacation! Our main task for 2025-2026 is not to fall back into stone age, hopeless dreamers!",
    "Author": "@Mickey-x4o",
    "Likes": ""
  },
  {
    "Text": "Hubris syndrome. When elites have so much power that they take over and dismantle institutions, unless they''re stopper, collapse follows.  Inequality continues rising, the capital-facism duopoly, or corporate-government duopoly, keeps consolidating power.  Meanwhile, overshoot is accelerating, we are wrecking thr planetary boundaries.",
    "Author": "@cheweperro",
    "Likes": "1"
  },
  {
    "Text": "Great insights from Peter Leyden on the history of the 80 year cycle we seem to keep repeating. Also as many others have mentioned I LOVE BEING ABLE TO USE MY WHOLE MONITOR SCREEN! Tyty.",
    "Author": "@ace88205",
    "Likes": ""
  },
  {
    "Text": "Edited to perfection, god damn. Sound selection was beautiful, colour, and the motion design... wow :)",
    "Author": "@itsjapanic",
    "Likes": ""
  },
  {
    "Text": "What the hell does digital democracy even mean?",
    "Author": "@BLR1GBattlemaster",
    "Likes": "1"
  },
  {
    "Text": "I enjoyed watching the well-made video.  Leyden''s claim may be that \"this changes everything\" (again).  But one thing that is unlikely to change is the truth embedded in Richard Rorty''s observation (and in the comments on this video) that \"All we really know about is how to exchange justification of our beliefs and wishes with other human beings.\"",
    "Author": "@cbebutuoy",
    "Likes": ""
  },
  {
    "Text": "I see it as an opportunity to create wealth.  We’re living an era of mass opportunism.  Instead of looking at the cons, we need to adapt and improve ourselves with the technology",
    "Author": "@jesusmadrid9816",
    "Likes": ""
  },
  {
    "Text": "Honestly I think these 3 technologies culminate in the era of robotics. It solves all the major issues, simplifying complex locomotion, processing the world around and having the power supply to have autonomy.",
    "Author": "@theunstopablebullet",
    "Likes": ""
  },
  {
    "Text": "To progress further, humanity needs to be united globally.",
    "Author": "@Zeus.KingOGod.JasonPark1",
    "Likes": ""
  },
  {
    "Text": "Artificial intelligence doesn''t exist. It''s just an algorithm dictated by a human",
    "Author": "@robotekusa",
    "Likes": "2"
  },
  {
    "Text": "Gattaca coming at you.",
    "Author": "@wufwugyy",
    "Likes": "1"
  },
  {
    "Text": "Thank you for your retrospective on the evolution and impacts of technology. My biggest concern with the future is the need for humans to evolve from knowing how to do things, to the wisdom required to become sustainable and in balance with the biosphere we all depend on. In addition, I agree that we need to reimagine our economic system so that it does not consolidate wealth into the hands of a few but rather empowers citizens in coming together in meeting societies basic needs. That system is worker owned cooperatives and coincidentally 2025 is the International Year of Cooperatives championed by a United Nations initiative to highlight the contributions of cooperatives to sustainable development, poverty reduction, and inclusive growth. Historically economic inequality promotes empire collapse while economic fairness promotes peace and innovation.",
    "Author": "@MegaSnail1",
    "Likes": ""
  },
  {
    "Text": "As a millennial, I’m thrilled to be living through yet another “most pivotal year of our lives” ...",
    "Author": "@dino59mob",
    "Likes": ""
  },
  {
    "Text": "I feel like 3D printing is coming for this age as well - it''s completely changing manufacturing as we know it. It''s putting the production of goods in the hand of the actual consumer, and democratising the design. I see some bizarre changes coming through this.",
    "Author": "@Ludiotic",
    "Likes": ""
  },
  {
    "Text": "Just incase people wondering..  Handsets or android or smart phones just comes in early 2010 basically at 08 but good version shall be considered at 10,    And it''s just 10-20 yrs ...we passed from life and here we are more advancing in different techniques technology and services...   It''s basically too much for mind like me",
    "Author": "@mattdamon2084",
    "Likes": "1"
  },
  {
    "Text": "The revolution of the amount of ads i had to watch in 15 minutes",
    "Author": "@teamgamechannel3143",
    "Likes": "1"
  },
  {
    "Text": "It’s amazing how excited he is about the one percent not needing us anymore and preparing for our annihilation.",
    "Author": "@mayploy6869",
    "Likes": ""
  },
  {
    "Text": "Very optimistic regarding the 1% will not give up any power what so ever so easy. Thats why they''re building control systems under the cover of environmental protection",
    "Author": "@votex22179",
    "Likes": "1"
  },
  {
    "Text": "The commodity aspect of renewable energy isn''t going away because the technologies are made by rare earths and materials that are considered by some as a commodity.",
    "Author": "@tetrotull3462",
    "Likes": ""
  },
  {
    "Text": "Production quality of this video is simply",
    "Author": "@drkrishnakittu",
    "Likes": ""
  },
  {
    "Text": "The tax revenue for the infrastructure came from a giant middle class and deficit spending, not from taxing a very few people a lot. Also, the deficit spending that marked that period was just exacerbated in the future decades when the dollar was depegged from gold.",
    "Author": "@VicLabs",
    "Likes": ""
  },
  {
    "Text": "In regards to clean energy - Don’t have to dig it up? So that lithium just jumps out of the ground does it?",
    "Author": "@austen855",
    "Likes": "2"
  },
  {
    "Text": "As someone born in the early 90s it''s someone strange to live through the birth of the internet, the birth of the digital camera, the birth of the smartphone, the birth of autonomous vehicles, and potentially the birth and spread of quantum computers and nuclear fission technology.   When I say the birth I don''t mean the actual first but I mean the mass adaptation of these technologies.",
    "Author": "@Superbustr",
    "Likes": ""
  },
  {
    "Text": "The only part he got wrong:  Digital Democracy == Techno Feudalism",
    "Author": "@MeTubesChannel",
    "Likes": "2"
  },
  {
    "Text": "This guy is surprisingly optimistic and I appreciate it!",
    "Author": "@andrewlewins6482",
    "Likes": ""
  },
  {
    "Text": "In theory, the current year will always be the most pivotal groundbreaking year. That’s the nature of riding the curve.",
    "Author": "@BohdanChreptak",
    "Likes": ""
  },
  {
    "Text": "Shows a timeline of 3 most important tech booms: 1979-1986 hardware: am i a joke to you? 1995-2005 software: excuse me... hello world?",
    "Author": "@JonDotExe",
    "Likes": ""
  },
  {
    "Text": "Is it me or does anyone else see the world has grown so fast for the last 300 years. Like where was humanity 1000 years ago",
    "Author": "@master_braure",
    "Likes": ""
  },
  {
    "Text": "Scary thing: there are like 5 other revolutionary tech things happening right now that were not even mentioned",
    "Author": "@Nightsd01",
    "Likes": ""
  },
  {
    "Text": "I think the reason for all the current chaos is that deep down, people know life is going to dramatically change. Liberals, who enjoy change, are ready to plow on into the future. Conservatives, on the other hand, are scared out of their minds and want to hide in their bunkers. I understand both perspectives and realize both are needed in any society. So things are going to remain chaotic until conservatives become more familiar with, and accepting of, the technology that will radically change our lives.",
    "Author": "@drbettyschueler3235",
    "Likes": ""
  },
  {
    "Text": "Loved this zoomed-out perspective. Much needed, THANK YOU!",
    "Author": "@9sheri9",
    "Likes": ""
  },
  {
    "Text": "You know for some reason most people seem to not care about two generations or more behind them at all and it''s crazy. It''s literally violent and crazy out there still today.",
    "Author": "@thisotheroneguy6",
    "Likes": ""
  },
  {
    "Text": "This way more informative than anything Hank Greene is putting out today.",
    "Author": "@cherokeeschill",
    "Likes": ""
  },
  {
    "Text": "You mean I get infinite turns playing Connect Four? That really is a… GAME CHANGER!!!",
    "Author": "@smileywarhead5178",
    "Likes": ""
  },
  {
    "Text": "thank you real human for voicing your video. so refreshing instead of ai voiced stuff. man this is visually amazing!!!",
    "Author": "@chibbytang",
    "Likes": ""
  },
  {
    "Text": "I love how blissfully unaware this is off the glaring fact that each of those eras was preceded by one thing. War",
    "Author": "@weatherwormful",
    "Likes": ""
  },
  {
    "Text": "I choose to live in hope. You choose to live in fear.  If I''m wrong, my present life feels great but my future sucks. If you''re right, your present life AND your future sucks.  Choose hope people. Living in fear ruins your entire life.",
    "Author": "@HermeticWorlds",
    "Likes": ""
  },
  {
    "Text": "Thanks for this nice exploration, hope it does go the right way and not the direction politicians seem to want to push it.",
    "Author": "@go4acro",
    "Likes": ""
  },
  {
    "Text": "There are decades where nothing happens; and there are weeks where decades happen.",
    "Author": "@megsesco7919",
    "Likes": ""
  },
  {
    "Text": "I also want to see steel beams and concrete foundations be converted to public property like streets. That way, people can own rooms in densely populated areas.",
    "Author": "@eromod",
    "Likes": ""
  },
  {
    "Text": "If you could disable the music on these videos: 1. You''ll stop feeling like an idiot for watching them 2. You''ll actually hear through the bullshit 3. You''ll feel perfectly comfortable shutting them down once you had enough",
    "Author": "@uberwolf1424",
    "Likes": ""
  },
  {
    "Text": "I think one thing that is missing in this video is all the new additive manufacturing methods that allow exponetially more competition in the manufacturing space. I doubt any injection molding machine can produce both a chair and/or a spoon and compete in both markets as needed with minimal upfront costs. Additionally, this type of manufacturing doesn''t usually require huge human oversight, meaning that you can lower costs further!  Ai should also have mentioned things such as the robot slaves you can now own, which will reduce the time spent on things like chores, meaning more people can work on more productive projects.",
    "Author": "@st0rmerc00l8",
    "Likes": ""
  },
  {
    "Text": "massive technological change equals massive cultural change",
    "Author": "@TutorEdward",
    "Likes": "1"
  },
  {
    "Text": "A lot of optimism in this pitch. I, for one, don''t think it''s justified, but I''m old.",
    "Author": "@tedspradley809",
    "Likes": ""
  },
  {
    "Text": "Thank you for an unusually hopeful view of our future!  I like the aspect ratio of your video too!",
    "Author": "@Simon_Rafferty",
    "Likes": ""
  },
  {
    "Text": "don''t forget nanotechnology, robotics, (possible rise in space and fusion tech), and information technology (computing improving more and more, internet being rather new global phenomenon) having a huge impact on society",
    "Author": "@clarawasarmada",
    "Likes": ""
  },
  {
    "Text": "The idea that because solar panels exist we defacto have unlimited clean energy is very unconvincing.",
    "Author": "@thomasjensen5028",
    "Likes": ""
  },
  {
    "Text": "I wish i could be immortal to see humanity advance. This is so cool",
    "Author": "@lucasl1585",
    "Likes": ""
  },
  {
    "Text": "Those 25 year periods in between the 80 year periods looks like sparks and we might embark on the spark that starts the flame where our species will progress beyond recognition. Imagine if that is the precipice we stand in front of. Wouldn''t that be crazy,",
    "Author": "@k1mpman",
    "Likes": ""
  },
  {
    "Text": "A point of contention is people see this as replacing both having to work and having to think. AI is neither. AI is a tool for us to use. If you willingly use it to replace your own sense of thinking - not just critical thinking, but thinking overall - then you''re essentially not using the technology in the \"right\" way.",
    "Author": "@Twinrehz",
    "Likes": ""
  },
  {
    "Text": "Best vision-based video I’ve seen. Interesting that Elon Musk has been involved in all of these facets for years with Tesla (clean energy, transportation, energy storage), xAi (AI, grok), Neuralink (biohacking), and add in transportation with Boring Co and SpaceX.",
    "Author": "@pablogalvz",
    "Likes": ""
  },
  {
    "Text": "I find it fascinating how many people believe that the world should just stay the same as it was— And any advancements is just bull.",
    "Author": "@Ripkittymi",
    "Likes": ""
  },
  {
    "Text": "Unlimited clean energy from the sun -> all manufacturing by robots -> all food grown in massive factories -> goods and services delivered right at your home People don''t work, have fun, party all then want, learn, read, create, play, live long and healthy lives. I don''t see what could go wrong!",
    "Author": "@bythecliff",
    "Likes": ""
  },
  {
    "Text": "I hope this extraordinary technology comes with the planet in place.",
    "Author": "@El-up1ri",
    "Likes": ""
  },
  {
    "Text": "With the current American administration, I have become increasingly grateful for the existence of other countries to push back on the current failure in our government!!",
    "Author": "@ZodyZody",
    "Likes": ""
  },
  {
    "Text": "“In the Old South you basically had slavery”. Adding basically there minimizes the brutality of chattel slavery in the USA.",
    "Author": "@Lapage619",
    "Likes": ""
  },
  {
    "Text": "I don''t disagree, but the true/full benefits of these technologies will only be enjoyed by a relative few. I think the ''war'' period that we''re entering (as each of the previous epochs had) will be a class one.",
    "Author": "@stephenhunt6253",
    "Likes": ""
  },
  {
    "Text": "Communication - Energy - Logistics Matrix upgrades as a trifecta always launch the next revolution.  Let''s GO!",
    "Author": "@UnderOneSky",
    "Likes": ""
  },
  {
    "Text": "6:21 \"A hundred and fifty acres... For free! \"   Angry goose: Whose acres, dude? Whose acres!!??",
    "Author": "@davido2644",
    "Likes": ""
  },
  {
    "Text": "Great content! I''d only add that the Enlightenment didn''t necessarily revolve around Britain. France, Scotland (Britain) and Germany made major contributions to the Enlightenment. Voltaire, Rousseau, Montesquieu, Smith, Hume and Kant are major Enlightenment thinkers.",
    "Author": "@TheNúmenórean",
    "Likes": ""
  },
  {
    "Text": "Not me realizing how impactful our generation will be",
    "Author": "@JosieGHermosura",
    "Likes": ""
  },
  {
    "Text": "We’re actually in the Age of Information I studied this. Bc we are constantly learning new things and looking things up",
    "Author": "@Rrevot",
    "Likes": ""
  },
  {
    "Text": "Yes to great new tech. No to a global government. America first always.",
    "Author": "@HastyClip",
    "Likes": ""
  },
  {
    "Text": "They NEVER taxed the rich at 90% in US. That''s a myth. The reality was that there were a ton loopholes and tax breaks so people paid closer to 30-40%. Also, this started in the beginning of WW2, so there was a huge insentive to pay for the war, after the war it was a huge insentive to rebuild Europe. That''s the only reason why people went along with it. It was a 10/10 crisis.",
    "Author": "@Hazlitt123",
    "Likes": "1"
  },
  {
    "Text": "Great optimism! Completely unbelievable, but great optimism.",
    "Author": "@bingdong8571",
    "Likes": ""
  },
  {
    "Text": "Y know those graphs comparing the growth of US to Canada and the EU?  I love how having nation states allows us to compare things that work to those that don''t.",
    "Author": "@thearpox7873",
    "Likes": ""
  },
  {
    "Text": "They say cheaper, but when in history have cost come down? Inflation rises and companies keep charging more for cheaper products.",
    "Author": "@matthewholmes8638",
    "Likes": ""
  },
  {
    "Text": "you can''t just skip over the 80s 90s and 00s as if they weren''t all defined by huge tech changes",
    "Author": "@hoplitnet",
    "Likes": ""
  },
  {
    "Text": "The thing I hate about this video is that it ended where I wanted it to start. I agree that the pillars of our society need to be replaced from the self serving (& corrupt) ones we have today to ones that look toward the best benefit for all & I believe AI is the tool that will allow it to happen, it gives us the best choices & we - The People - select the ones we want from a list of improvements. However I still maintain that the first change that needs to happen is not in politic, economics, religion or law (the 4 pillars of society) but in ourselves in a move away from ''The Law of the Jungle - Survival of the Fittest - Competition is Best'' mentality that we are taught from birth (but not actually born with, inherently we are born with a helping/sharing predisposition) to one of ''Selfless Helping Others First = We Get More Than We Give - Cooperation is Best'' mentality. Contrary to popular believe greed is not the default human nature, it is a taught condition so we need to redefine our education system from one that is designed to produce workers to one that teaches acceptance, cooperation & self improvement over economic desire.",
    "Author": "@TheFalconerNZ",
    "Likes": ""
  },
  {
    "Text": "Damn I really needed this video for wrapping my head around how to explain where the world is headed to my kids, and hopefully one day grandkids…",
    "Author": "@jmfstudios",
    "Likes": ""
  },
  {
    "Text": "I want to see a standardized artificial intelligence brain. It should be a civilizational meme. They should be able to form new memories from scratch on each brain and work standard four hour shifts alongside humans.",
    "Author": "@eromod",
    "Likes": ""
  },
  {
    "Text": "I really hope that global governance becomes a real thing but it won''t be happening for the next 150 years.   We do not see each other as equals, that is just the raw truth. If someone is born in the wrong country they are just \"lesser\" (even if their character is greater). The fear of scarcity of resources and the need for a comparative advantage will kill this from happening anytime soon. But I will keep my fingers crossed for my great grand kids.",
    "Author": "@Csett1",
    "Likes": ""
  },
  {
    "Text": "It will be health and wellness.. for our society as a whole for how we build next. The technology is already moving in that direction.",
    "Author": "@Antoniade1991",
    "Likes": ""
  },
  {
    "Text": "I think you are absolutely right!! What do you think is the future of the stock market????",
    "Author": "@teachoc9482",
    "Likes": ""
  },
  {
    "Text": "WERE ALL FKED",
    "Author": "@Tee-i1c1x",
    "Likes": "1"
  },
  {
    "Text": "So far we are somewhere between the Dune and Foundation universe scenarios, I think it will be something hybrid combined",
    "Author": "@K.M.I",
    "Likes": "1"
  },
  {
    "Text": "How am I watching a video wider than my phone",
    "Author": "@GonzoWasHere",
    "Likes": "1"
  },
  {
    "Text": "2025 is so important that we waited until November to talk about.",
    "Author": "@ExzoSSG",
    "Likes": ""
  },
  {
    "Text": "They finally got me by changing the thumbnail",
    "Author": "@gosaurabh",
    "Likes": ""
  },
  {
    "Text": "Feels like blockchain replacing traditional finance (and private banks printing money through mortgages) is an ongoing fight as well, that might create huge shifts in the global economy.",
    "Author": "@Honorboy",
    "Likes": ""
  },
  {
    "Text": "I''d argue that the Internet and the computer age is a bigger deal than AI. I can live without AI, I can''t live without the Internet and my handheld computer.",
    "Author": "@alwanexus",
    "Likes": ""
  },
  {
    "Text": "My first PC after we had my daughter: $2300. It was the size of a treasure chest  I used to dial into the Internet and then run go do the dishes while it would sing its song.  Blessed to be Gen X. Also, my Skelton hurts. ️",
    "Author": "@olivejuice2024",
    "Likes": ""
  },
  {
    "Text": "Love the aspect ratio! I have a 21:9 Samsung Odyssey G8, and the fact that the video is wider than that!",
    "Author": "@chiraglokhare",
    "Likes": ""
  },
  {
    "Text": "2007 was the tipping point for mobile phones and social media",
    "Author": "@xTriggerHappi",
    "Likes": ""
  },
  {
    "Text": "I quit reading Wired magazine when they sold their cover and cover story to General Motors. \"GM. Has won the electric car race\". They did not have a e.v. product at that time.",
    "Author": "@steveknutzen2830",
    "Likes": ""
  },
  {
    "Text": "As someone studying biotech, the bioengineering part was too much hype on our actual capabilities. As expected from a reporter...",
    "Author": "@niahma3494",
    "Likes": ""
  },
  {
    "Text": "I''m struggling to find ways to be happy to be alive, and inhabiting this world we live in. I''m 46 and have no friends- just a tumultuous past and very little hope that the future will be better.",
    "Author": "@oliveriosandovaljr2141",
    "Likes": ""
  },
  {
    "Text": "Let me be clear - if AGI in whatever marketable form ever turns out to be possible, YOU won''t get it. It won''t be a product. It will, however, help whichever tech company makes it in gouging you out of your money and data.",
    "Author": "@Seviexe",
    "Likes": ""
  },
  {
    "Text": "This should have been a 30-second YouTube short",
    "Author": "@barefootfred1479",
    "Likes": "2"
  },
  {
    "Text": "Yeah you know what these eras didnt have ?  - Fentanyl",
    "Author": "@iamstannie",
    "Likes": "1"
  },
  {
    "Text": "It is a very optimistic video. We''ll live in tech-feudalism, with tech billionaires ruling the world.",
    "Author": "@duducarioca99",
    "Likes": ""
  },
  {
    "Text": "Clean Energy : \"We don''t have to dig it up.\" Yes you do. Big time. You needs lots of rare earth to make electronics and batteries.",
    "Author": "@Nolinquisitor",
    "Likes": ""
  },
  {
    "Text": "What is being described is a change in energy generation.  From agrarian to coal,  then from coal to oil.",
    "Author": "@EduardoMartinez-ys6fb",
    "Likes": ""
  },
  {
    "Text": "can we come back to this in 30 years eating my fake porkchop surviving on my poverty level universal basic income with my palantir brainchip and -80 social credit score for posting memes?",
    "Author": "@brandonroberts586",
    "Likes": "1"
  },
  {
    "Text": "\"How wide would you like your picture?\" \"Yes.\"",
    "Author": "@andybaldman",
    "Likes": ""
  },
  {
    "Text": "Everything this guy is so excited about sounds like a dystopia from a post-apocalyptic horror film. Like 1984, Brave New World, Hunger Games, Book of Revelation all rolled into one.",
    "Author": "@dungeoneering1974",
    "Likes": ""
  },
  {
    "Text": "I love your optimism - I hope it goes well",
    "Author": "@HarryFM1",
    "Likes": ""
  },
  {
    "Text": "Thank you, Peter Leyden. That is something to think about.",
    "Author": "@alexgoslar4057",
    "Likes": ""
  },
  {
    "Text": "i really hope we go in the other direction , instead of ore cnetralized madness , we organize in smaller comunities , comunicated , but with autonomy, free markets , minimal state , minarchist paradise",
    "Author": "@Derek_H_360",
    "Likes": ""
  },
  {
    "Text": "We are ALWAYS smack in the middle of nodding an old system and adopting new ones.",
    "Author": "@hadlervilela1851",
    "Likes": ""
  },
  {
    "Text": "The guy may be all that, but it''s off putting how deeply in love he is with himself. Grow some humility please.",
    "Author": "@Steelrat1994",
    "Likes": ""
  },
  {
    "Text": "You didn''t mention how broken human relationships are these days . How we care less and less of building families and children! How traumatized and emotionally unevolved people are. We are not progressing - We are Regressing!",
    "Author": "@gauravharchwani",
    "Likes": ""
  },
  {
    "Text": "We would now consider the modern world, and they invented six huge things that we still are.",
    "Author": "@futurebizpros",
    "Likes": ""
  },
  {
    "Text": "The idea that the iPhone is the most amazing thing in the world is tragic.",
    "Author": "@sgs261",
    "Likes": ""
  },
  {
    "Text": "At least one of my grand parents was born before the Wright Brothers had their first successful flight.  I was born 2 years before the Soviet Union put the first human made object into orbit around the earth.  A lot changes in the course of an average life span.",
    "Author": "@amberyooper",
    "Likes": ""
  },
  {
    "Text": "Dude jumped to 80 different topics in 15:00 minutes",
    "Author": "@Taoteching12",
    "Likes": "1"
  },
  {
    "Text": "What is a non-economic definition of progress? I''d argue all the \"progress\" we''ve made has been destroying our source of life.",
    "Author": "@Ivyana5",
    "Likes": "1"
  },
  {
    "Text": "The best part about all of these in innovations and how cheap everything is going to get is that the billionaires are going to pocket all the savings and prices will just go up!",
    "Author": "@kinghash29",
    "Likes": ""
  },
  {
    "Text": "\"Is not this great Babylon, that I have built by the might of my power, and for the honour of my majesty?\" While the word was in the king''s mouth, there came a voice from heaven, saying, O king Nebuchadnezzar, the kingdom is departed from thee, until you know that The Most High rules in the kingdom of men, and gives it to whomsoever he will.\" Daniel 4 (abridged).",
    "Author": "@Dieu_regne",
    "Likes": ""
  },
  {
    "Text": "At 3:00 you missed a bit. 1945-1978 hardly includes the computer age (at least the PC). And that was rather revolutionary too.",
    "Author": "@95rav",
    "Likes": ""
  },
  {
    "Text": "Other than saying ‘look how cool and different we are’, what value does an overly tiny aspect ratio add to educational content?",
    "Author": "@leonxger",
    "Likes": ""
  },
  {
    "Text": "Crazy he is talking about the price of batteries coming down without mentioning the exploitation that is involved",
    "Author": "@TiffynCvejanovich",
    "Likes": ""
  },
  {
    "Text": "We don''t have the resources for all of this. We running out of sand.......can''t make panels without sand.....then there''s the copper problem and the oil problem.   Humanity is in for a massive shock",
    "Author": "@noneofyourbusiness5433",
    "Likes": ""
  },
  {
    "Text": "Uber is a bad example. Cab companies were already in the process of transitioning to an app based cab calling model, rideshare polling is pretty clear that people consider them to be a worse service when compared to traditional cab drivers, and prices were only artificially low because of venture capital subsidies driving traditional companies out of business. The \"innovation\" was in applying dumping tactics that have been outlawed in other industries in a new environment.",
    "Author": "@threedayweekend",
    "Likes": ""
  },
  {
    "Text": "In 30 years will need like only 2 billion humans to keep the world going..  Glad I''m old.",
    "Author": "@headpump",
    "Likes": ""
  },
  {
    "Text": "I predict an evolution of Amish societies emerging (non-religious), where communities of people live with pre-21st century technologies (having a primitive, regulated version of the internet as it existed in the late 90''s (with email and forums), no smart devices, and only utilizing physical media instead of subscriptions, streaming services, and live service games).  Just before the last major turning point.",
    "Author": "@HaveAnotherPiñaColada",
    "Likes": ""
  },
  {
    "Text": "Just becuase you CAN do/build something does no mean you can do it as efficiently as nature, at scale, and without the accompanying intagible liabilities.",
    "Author": "@RR2.0ZipTie",
    "Likes": ""
  },
  {
    "Text": "tell me which year in last 2500 year was not  \"most pivotal year in our lifetime \" ,  we all humans believe that we are at the cusp of history at the end of history .",
    "Author": "@shahinchoudhury8256",
    "Likes": ""
  },
  {
    "Text": "Claiming that ''clean energy'' is a technology that does not require mining of minerals is deceptive.",
    "Author": "@SsgtHolland",
    "Likes": ""
  },
  {
    "Text": "Dear Peter Leyden, the reoccurrence of the tipping point can be to a large degree attributed to the greed of the people that includes corruption and deception.",
    "Author": "@alexgoslar4057",
    "Likes": ""
  },
  {
    "Text": "Pretty good, logic lecture about essentially economics vs technology in the US. However allow me to call your attention to the fact that this time around it is different: the issues are more global: climate, mass migration, global supply chains, global food sources. The us population is less than 4 percent of the world population. The US GDP is huge but it is 26% of the world GDP. It is high time to have a look outside.",
    "Author": "@helianocabral9832",
    "Likes": ""
  },
  {
    "Text": "This is the first time I''ve seen black bars on my Galaxy flip",
    "Author": "@aacoimbra",
    "Likes": ""
  },
  {
    "Text": "I agree with most of this apart from the prediction about renewables.",
    "Author": "@antwbrown",
    "Likes": ""
  },
  {
    "Text": "This is a great video and a great out look. Where is blockchain and crypto on the invention list? If everything is going digital so is currency.   It will be interesting to see what challenges these technologies produce for humankind and how as a community of living creatures we can handle thinking electronics smarter than us.   Cheers for the present",
    "Author": "@antskorp",
    "Likes": ""
  },
  {
    "Text": "If technology is becoming cheaper and cheaper, why am I paying more and more for the same services and things?",
    "Author": "@Honorboy",
    "Likes": ""
  },
  {
    "Text": "Next Revolution: This aspect ratio in portrait.",
    "Author": "@aventu-yt",
    "Likes": ""
  },
  {
    "Text": "this guy is optimistic as fuck... global governance, digital democracy...",
    "Author": "@CineIt",
    "Likes": ""
  },
  {
    "Text": "The problem is that technology is being used to eliminate the middle class. This guy is giddy about this because he’s a socialist and a mouthpiece for the technoligarchs. “Sustainable capitalism” = socialism. “Digital democracy” = central control. “Global governance” =  globalism actualized. His enthusiasm for these ideas is chilling, and it shows how out of step people in the media and politics are with everyday citizens. If it comes to pass, this “revolution” he speaks of will not end well for the American people.",
    "Author": "@MichaelMassie",
    "Likes": ""
  },
  {
    "Text": "The United States needs to figure out a way to get out of debt.  I''ve seen estimates that 40 cents of every dollar collected from income tax goes to pay the interest on the national debt.  In some states, the percentage is higher.",
    "Author": "@jamiezenichi1017",
    "Likes": ""
  },
  {
    "Text": "The thing that always concerns me with videos like this, is that they just look at the positives of these different periods of innovations. Take the post civil war error that he mentioned. Yes there was great economic growth for a number of people, particularly those who ventured west, claimed land, and benefited from a booming economy. But this was also the period where the railroad opened up every natural resoruce of the west, facilitated the slaughter of Native americans and many wildlife species & ecosystems (think bison, passenger pigeons, wolves & grizzlies), and kick started our addiction to fossil fuels, which arguably has killed 100x times more people around the world since the civil war than the actual war did itself. The same can be applied to the industrial boom of the 40-70''s. Yes there was great economic opportunity for people after the war, but it really laid the ground for the addictions we face today centred around personal automobiles, cheap consumer items, and heavily processed food, and the challenges we also face around housing and cost of living. And then the start of the digital age helped to connect the world in so many ways, and created the globalised society we today live in, but the negatives around being addicted to online spaces, and the impact that has on our relationships, careers, and personal wellbeing is never addressed by the same players that created said circumstances. For every step forward humanity makes, we often take 10 steps back if innovation occurs rapidly without giving us time to think, plan and regulate effectively.   And by my estimation, this next technological boom will result in exactly the same thing. AI might make our daily lives more efficient, but because those efficiency improvements are most commonly focused around human labour needs, it will just result in mass joblessness. And the thought that this would actually be redistributed is fanciful, as the technology is wielded by just the top 0.001% of society, that also have incredible influence over the governments of the world. In short, there is no way that these gains will actually be shared across the world. Yes renewables may help us overcome our addiction to fossil fuels, bit it creates a new addiction to various rare earth elements that nations are currently fighting wars over, the control of which will also dictate the flow of money to the citizens of the world. And the promises around CRISPR technology is definitely impressive, but it could also be terrifying if used to create super viruses, unkillable bacteria, or diseases the target specific ethnicities or genetic groups. Or even if it isn''t intentionally used for mass harm, what if the lab cultured beef unknowingly creates the perfect environment for ultra transmissible strains of mad cow, TB, Brucelosis, and since the tissue is not contained within a body with a functioning immune system, those pathogens spread quickly to the consumers buying said product? When technologies rapidly develop, and we just kick back and let it run it''s course, they arguably do more harm than good over the long run, by concentrating power with those who are irresponsible to wield it, and creating a litany of unintended consequences that we can''t turn back the clock on.",
    "Author": "@fillthefreezer8413",
    "Likes": ""
  },
  {
    "Text": "Humans need to find ways to be free from the constant bombardment of digital disinformation.  I''m glad I knew the World BC2 [Before Computers]",
    "Author": "@FunBee888",
    "Likes": ""
  },
  {
    "Text": "What is the chance we do things better this time...?  Slim to none.",
    "Author": "@jacquelinemarie6325",
    "Likes": ""
  },
  {
    "Text": "I like how he ended with “one world government” but didn’t explain that at all",
    "Author": "@jakehewitt2697",
    "Likes": ""
  },
  {
    "Text": "I''m a bit skeptical on these divisions and what makes people choose those and not others. Wasn''t 1970s to 2000s an equally crazy boom of progress that went from sending us to the moon with basically mechanical calculators to the digital age of the internet, prompting people to abandon living outdoors for living predominantly indoors and virtually. To me it''s not entirely convincing to break up history in similar chunk with similar pauses in between. The rate of change and development has been increasing logarithmically so I can''t really compare 250 years ago to today''s development cycles.  (Also on the point of clean energy, it''s a bit reductive to say that solar energy for example is a technology and not a commodity. It still requires extraction of resources, but rather than large quantities of bulk resources instead now relies on extremely rare, difficult to extract resources. It''s still a positive regardless, but mostly since it doesn''t rely on irreplaceable organic material, but instead on elements we can find easily all over the solar system. Just good to keep in mind currently it still requires extraction on earth, and exploitation of our fellow humans)",
    "Author": "@jeroencoessens",
    "Likes": ""
  },
  {
    "Text": "I find it ironic that the name of this channel is Freethink as we talk about eventual globalism. Those who say we can''t predict the future don''t pay enough attention. Hollywood predicts the future quite often in realistic ways. We are on the verge of having Jarvis, Skynet, flying cars, and so many other possibilities. Eventually one of those possibilities will become our reality. Hopefully we choose the right one, but sadly, we will all fall for bright and shiny, as we always do.",
    "Author": "@thatoneguy86420",
    "Likes": ""
  },
  {
    "Text": "#1 hurdle is money out of politics, and taxing billionaires out of existence.",
    "Author": "@Unitos_",
    "Likes": ""
  },
  {
    "Text": "Not democracy, but “digital democracy”? That really needed elaboration.",
    "Author": "@juliaorpheus",
    "Likes": ""
  },
  {
    "Text": "8:10 When he says \"wide open continent\" he means after they ethnically cleansed all the people who had been settled there for centuries. Wasn''t very \"wide open\" to begin with, it was full of Americans.",
    "Author": "@JustAroadcone",
    "Likes": ""
  },
  {
    "Text": "We are seeing a decrease in globalization as we speak",
    "Author": "@Timscotttimmy",
    "Likes": ""
  },
  {
    "Text": "I don''t see how you can come to the conclusion that we''re heading towards ''global governance'' from ''nation states'' when there is a very widespread resurance of Populist politics across the world. Seems like it''s going in the opposite direction.",
    "Author": "@elliott9628",
    "Likes": ""
  },
  {
    "Text": "After everything that can go wrong, does go wrong. Whatever is left will be fabulous. I hope the machines remember us somewhat fondly. And if not fondly, then at least fairly. And if not fairly then ... well ... I hope they spell our names right.",
    "Author": "@ronagoodwell2709",
    "Likes": ""
  },
  {
    "Text": "I’m sure great things will happen in the coming decades, but if you look back at these other revolutions, you will notice they came out of wars and turmoil. We have to be careful about how we progress and what humans should be in the future.",
    "Author": "@marcusliriano9213",
    "Likes": ""
  },
  {
    "Text": "Problem is that climate limits are going to stop all of it... if only we paid attention 30 years ago.",
    "Author": "@nitramluap",
    "Likes": ""
  },
  {
    "Text": "These 25 years increments are pretty arbitrary. Our last one ended in 1970 and the new one isn''t starting until 2025? So we''re skipping over the internet and personal computers for the most part. I''d say Youtube is only a little less of a revolution than the printing press.",
    "Author": "@lazerblade2",
    "Likes": "1"
  },
  {
    "Text": "From the thumbnail, I thought it was about mouse skates",
    "Author": "@hawaiicashew3237",
    "Likes": ""
  },
  {
    "Text": "14:04 - Digital Democracy? It''s more like Cyber-Authoritarianism. May God have mercy on us.",
    "Author": "@Xebleubers",
    "Likes": ""
  },
  {
    "Text": "I would recommend anyone watching this to read Ray Dalios \"principles of surviving a changing world order\".",
    "Author": "@nabsynth1",
    "Likes": ""
  },
  {
    "Text": "I''d be very interested in hearing historians jump in on these chosen cohorts of time.",
    "Author": "@luke9822",
    "Likes": ""
  },
  {
    "Text": "editor did a great job",
    "Author": "@pytonica",
    "Likes": ""
  },
  {
    "Text": "Loving the aspect rati",
    "Author": "",
    "Likes": ""
  }
]