[
  {
    "Text": "First and W Erik for keeping me and all of us motivated",
    "Author": "@qasimraza5750",
    "Likes": 10
  },
  {
    "Text": "My goat erik! You''ve helping me push me through my comp eng journey and motivating to not give up even in the world of ai,  i truly do appreciate you! I''m on track on building a calorie tracking app  thanks again!",
    "Author": "@nayef62",
    "Likes": 4
  },
  {
    "Text": "I am going to make app for my college where everyone will get connected together (from different stream or different classes, including teachers) because my college has its own app but it sucks at everything. Thanks Bro",
    "Author": "@MindForgeXofficial",
    "Likes": 4
  },
  {
    "Text": "I''ve been following you for a while now, to be honest I''ve almost given up on programming after 3 years of coding without getting hired or an internship but just simply watching you, your journey and all that keeps me motivated. thanks man. from Nigeria",
    "Author": "@magacod",
    "Likes": 1
  },
  {
    "Text": "step 1: be an youtuber so anything you do already has free marketing. good ideas overall, the pain is just breaking that 0 costumers wall.",
    "Author": "@frytura",
    "Likes": 1
  },
  {
    "Text": "Hello erik , i think the key point and the hard part is getting ur app advertised to users. Your youtube channel is the biggest asset .",
    "Author": "@MahdiJellali-b4t",
    "Likes": 1
  },
  {
    "Text": "Yo Erik, I’ve gotta say I’m a huge fan. Thanks for the awesome guide—seriously, it’s the best one on YouTube so far. Also about Warp: I’ve been building multiple projects using Cursor lately, and in my opinion it’s the best option for large-scale projects because of the AI integration. Anyway, just wanted to say thanks for the constant content. Keep it up!",
    "Author": "@ZolosMarejg-fq1lm",
    "Likes": null
  },
  {
    "Text": "Im a QA software engineer that does not know how to develop a web or mobile app. I got an idea to build a calisthenics web app and test it along the way as a tester, something that would help me with my progression in calisthenics. As a person that likes to be active in the gym and wants to learn calisthenics on the way i thought this would be a cool project to build both helping me with my progression with calisthenics and learn how to develop something. Yes there are a lot of things out there already regarding this but I want to shoot my shot. Was wondering if you would have any tips for me. Appreciate your content!",
    "Author": "@KonuralpCabuk",
    "Likes": 6
  },
  {
    "Text": "Erik is genuinely a inspiration bro makes me realize I can be doing more",
    "Author": "@hugoperez3002",
    "Likes": null
  },
  {
    "Text": "What watch are you using, i love it, anyway nice video!",
    "Author": "@rubenarce5514",
    "Likes": 1
  },
  {
    "Text": "That''s helped me a lot, very thankful",
    "Author": "@astroff6431",
    "Likes": null
  },
  {
    "Text": "bruh..your videos are amazing.I want some kinda tips for switching to high paying jobs based on the preparation for an experienced one in development side.",
    "Author": "@mr.thugist9564",
    "Likes": null
  },
  {
    "Text": "I''ve been doing FSO for more than 4 months now, it''s a heavy course. How long did it take you to go from learning JS to shipping an actual app?",
    "Author": "@birthdaygal",
    "Likes": 1
  },
  {
    "Text": "Always remember building about an app is not about making money, is about solving problems never forget. P.s am not rich i live in Nigeria but building apps just to make money  thay shouldn''t be your priority. N.B solve problems, money will come.",
    "Author": "@hidden3-n2x",
    "Likes": 1
  },
  {
    "Text": "hey man been watching you for a while now and i like your content, what would you sugest for me ? i am currently learning html in odin project, should i do the javascript part after css, or learn from the video you sugested instead ? have you done the odin project yourself ?",
    "Author": "@VoonV",
    "Likes": null
  },
  {
    "Text": "Great video for motivation. Do you happen to know if TypeScript is similar to JavaScript? Thanks",
    "Author": "@agentxstudiosofficial",
    "Likes": 1
  },
  {
    "Text": "i am coocked cuz of my graduation project and was kinda stuck which tech stack to use, now i think its clear and i have 5~7 months till june and hand over my project/thesis defense so wish me good luck",
    "Author": "@barhoomz",
    "Likes": null
  },
  {
    "Text": "w video I was surprised you didn''t mention cursor as ai tool but I think they all do the same thing",
    "Author": "@EliosGameover",
    "Likes": null
  },
  {
    "Text": "I love Gamma cuz it creates wonderful presentations.",
    "Author": "@odxed",
    "Likes": null
  },
  {
    "Text": "Hey erik, how should I get started? I just know c and java basics. I am currently in my 1st yr cse core degree",
    "Author": "@Lumina-HD",
    "Likes": 1
  },
  {
    "Text": "Thank you for the video! I just did CS50P-an introductory course on python and I’m not sure what to do next. I’m not sure what I wanna do so I wanna explore…and take on a skill/path I find interesting and can generate income. Any advice?",
    "Author": "@Study-mations",
    "Likes": null
  },
  {
    "Text": "I''m thinking of creating a sales app for my country. 🇦🇴",
    "Author": "@FUTBALL-x1g",
    "Likes": 1
  },
  {
    "Text": "All what you are saying is right but you already have a good community and followers to market and sell yours apps and product. I would say first build a community on social media post post and post …",
    "Author": "@AI-RESEARCH-TECH-z1j",
    "Likes": null
  },
  {
    "Text": "Should I learn three js ? Going into 2026?",
    "Author": "@RezaeiArshad",
    "Likes": null
  },
  {
    "Text": "should make a course on Javascript and NextJS",
    "Author": "@TurboTrend12",
    "Likes": null
  },
  {
    "Text": "yo whats your keyboard?",
    "Author": "@JonyP1234",
    "Likes": null
  },
  {
    "Text": "Yup that all it takes",
    "Author": "@neilpatel2365",
    "Likes": null
  },
  {
    "Text": "do you code everything in your app yourself from scratch or you take help from ai ? and seeing today market what should i learn web devlopment or mobile application development please give your opinion",
    "Author": "@Victus-g6f",
    "Likes": null
  },
  {
    "Text": "hey what about flutter should i learn that coz i don''t have mac to go with react native",
    "Author": "@HistoryNaps",
    "Likes": null
  },
  {
    "Text": "Hi bro I’m a beginner. Do I only need to learn JavaScript or html and css as well. Thanks",
    "Author": "@KryzeVal",
    "Likes": null
  },
  {
    "Text": "Best video",
    "Author": "@nitinnegi455",
    "Likes": null
  },
  {
    "Text": "Is resumax logic based on the openai api",
    "Author": "@brunx9670",
    "Likes": null
  },
  {
    "Text": "btw do u have other AI assistance cuz claude doesn''t work in my region",
    "Author": "@barhoomz",
    "Likes": null
  },
  {
    "Text": "BRO, I''m building my AI conversation skill app, but I''m having trouble connecting the payment webhook with the app can you solve that.",
    "Author": "@ur_rar",
    "Likes": null
  },
  {
    "Text": "NGMI",
    "Author": "@darthvader4899",
    "Likes": null
  },
  {
    "Text": "W vid",
    "Author": "@K-k573",
    "Likes": null
  },
  {
    "Text": "Im building a app that helps with ordering system for business for my country   They can add their products, generate a website, and receive all orders directly on WhatsApp. It also has automation, like auto-replies, price estimates, and order tracking. It’s built for spaza shops, food sellers, and small stores who want to take orders fast without expensive e-commerce sites.",
    "Author": "@Itz_sufiX",
    "Likes": 1
  }
]
